W4/W4D4/99cats/app/views/cats/show.html.erb

  <h1>Rental Requests</h1>
  <% if @cat.rental_requests.empty? %>
---
SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 LIMIT 1  [["cat_id", 1]]